{"format": "graph-model", "generatedBy": "2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.4", "signature": {"inputs": {"input-attr:0": {"name": "input-attr:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"accuracy_calc/output-attr:0": {"name": "accuracy_calc/output-attr:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "layer1/Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer1/Variable_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer2/Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer2/Variable_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "output/Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "output/Variable_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/output-attr/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input-attr", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer1/MatMul", "op": "MatMul", "input": ["input-attr", "layer1/Variable"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "layer1/add", "op": "AddV2", "input": ["layer1/MatMul", "layer1/Variable_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer1/Relu", "op": "Relu", "input": ["layer1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer2/MatMul", "op": "MatMul", "input": ["layer1/Relu", "layer2/Variable"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "layer2/add", "op": "AddV2", "input": ["layer2/MatMul", "layer2/Variable_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer2/Relu", "op": "Relu", "input": ["layer2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output/MatMul", "op": "MatMul", "input": ["layer2/Relu", "output/Variable"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "output/add", "op": "AddV2", "input": ["output/MatMul", "output/Variable_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output/Softmax", "op": "Softmax", "input": ["output/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/output-attr", "op": "ArgMax", "input": ["output/Softmax", "accuracy_calc/output-attr/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "layer1/Variable", "shape": [784, 512], "dtype": "float32"}, {"name": "layer1/Variable_1", "shape": [512], "dtype": "float32"}, {"name": "layer2/Variable", "shape": [512, 64], "dtype": "float32"}, {"name": "layer2/Variable_1", "shape": [64], "dtype": "float32"}, {"name": "output/Variable", "shape": [64, 10], "dtype": "float32"}, {"name": "output/Variable_1", "shape": [10], "dtype": "float32"}, {"name": "accuracy_calc/output-attr/dimension", "shape": [], "dtype": "int32"}]}]}